OpenFoam/simpleNoFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Inlet
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }
    Outlet
    {
        type            patch;
        nFaces          1;
        startFace       100;
    }
    leftwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       101;
    }
    rigtwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       201;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       301;
    }
)

// ************************************************************************* //
