OpenFoam/simpleNoFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   
    (  0     0   0)   //0
    (0.1     0   0)   //1  
    (0.1 -0.01   0)   //2 
    (  0 -0.01   0)   //3   
    (  0     0   1)   //4
    (0.1     0   1)   //5  
    (0.1 -0.01   1)   //6 
    (  0 -0.01   1)   //7   
);
 
blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 100) simpleGrading (1 1 1)
);
 
edges();
 
boundary
(

    Inlet           { type patch; faces ((3 2 1 0)); }
    Outlet          { type patch; faces ((4 5 6 7)); }

    leftwall        { type wall;  faces ((0 4 7 3)); }
    rigtwall        { type wall;  faces ((1 2 6 5)); }

    empty           { type empty; faces ((0 1 5 4)( 3 7 6 2)); }
);
 
mergePatchPairs();


//   7
//4        6
//|    5
//|
//|
//|  3     
//0        2
//     1